/*
Задача 19
Напишите программу, 
которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
*Сделать вариант через СЛОВАРЬ четырехзначных палиндромов
*/

#include <iostream>
using namespace std;

/*Аналогичная задача с 17, можно примить пробывать в других процессах решения.
Плюс, попробовал другу форму записи кода, оптимизировал.*/

void main()
{
    setlocale(LC_ALL, "ru");
    int a;
    cout << "Введите 5ти значное число - ";
    cin >> a;
    for (int i = 0; i < a/2; i++)
    {
        if
    }
}
//Дорешать.